app/views/users/show.slim

SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 1]]
---
      li.tab.col.s3
        = link_to "Questions (#{@user.questions.size})", "#questions"